error_mess = {'UA': 'Вибачте функція в даний час не працює',
              'CZ': 'Omlouváme se, funkce je dočasně deaktivována.',
              'RU': 'Извините функция в данный момент не работает'}

choose_lang = {'TEXT': 'Choose your language: ',
               'UA': 'Виберіть мову: ',
               'CZ': 'Vyberte jazyk: ',
               'RU': 'Выберите язык: '}

start_text = {'UA': 'Вас вітає програма для розрахунку грубої зарплати \n'
                               'Інформація для розрахунку актуальна на 2024 рік \n'
                               'Виберіть необхідну дію:',
              'CZ': 'Vítejte ve mzdovém softwaru.\n'
                               'Informace jsou aktuální pro rok 2024.\n'
                               'Vyberte požadovanou akci: ',
              'RU': 'Вас приветствует программа для расчета грубой з/п.\n'
                               'Информация расчета актуальная на 2024 год.\n'
                               'Выберите необходимое действие: '}

choice_start_but1 = {'UA': '▶️ Розрахувати',
                     'CZ': '▶️ Vypočitat',
                     'RU': '▶️ Расчитать'}

choice_start_but2 = {'UA': '◀️ Назад',
                     'CZ': '◀️ Zpět',
                     'RU': '◀️ Назад'}

choice_start_but3 = {'UA': '📒 Історія',
                     'CZ': '📒 Historii',
                     'RU': '📒 История'}

fill_data = {'UA': 'Ок. Виберіть параметри: ',
             'CZ': 'Ok. Vyberte možnosti: ',
             'RU': 'Ок. Выберите параметры: '}

month_text = {'UA': 'Виберіть місяць: ',
              'CZ': 'Vyberte měsíc: ',
              'RU': 'Выберите месяц: '}

January = {'UA': 'Січень', 'CZ': 'Leden', 'RU': 'Январь'}
February = {'UA': 'Лютий', 'CZ': 'Únor', 'RU': 'Февраль'}
March = {'UA': 'Березень', 'CZ': 'Březen', 'RU': 'Март'}
April = {'UA': 'Квітень', 'CZ': 'Duben', 'RU': 'Апрель'}
May = {'UA': 'Травень', 'CZ': 'Květen', 'RU': 'Май'}
June = {'UA': 'Червень', 'CZ': 'Červen', 'RU': 'Июнь'}
July = {'UA': 'Липень', 'CZ': 'Červenec', 'RU': 'Июль'}
August = {'UA': 'Серпень', 'CZ': 'Srpen', 'RU': 'Август'}
September = {'UA': 'Вересень', 'CZ': 'Září', 'RU': 'Сентябрь'}
October = {'UA': 'Жовтень', 'CZ': 'Říjen', 'RU': 'Октябрь'}
November = {'UA': 'Листопад', 'CZ': 'Listopad', 'RU': 'Ноябрь'}
December = {'UA': 'Грудень', 'CZ': 'Prosinec', 'RU': 'Декабрь'}

month_1 = {'UA': 'Січень', 'CZ': 'Leden', 'RU': 'Январь'}
month_2 = {'UA': 'Лютий', 'CZ': 'Únor', 'RU': 'Февраль'}
month_3 = {'UA': 'Березень', 'CZ': 'Březen', 'RU': 'Март'}
month_4 = {'UA': 'Квітень', 'CZ': 'Duben', 'RU': 'Апрель'}
month_5 = {'UA': 'Травень', 'CZ': 'Květen', 'RU': 'Май'}
month_6 = {'UA': 'Червень', 'CZ': 'Červen', 'RU': 'Июнь'}
month_7 = {'UA': 'Липень', 'CZ': 'Červenec', 'RU': 'Июль'}
month_8 = {'UA': 'Серпень', 'CZ': 'Srpen', 'RU': 'Август'}
month_9 = {'UA': 'Вересень', 'CZ': 'Září', 'RU': 'Сентябрь'}
month_10 = {'UA': 'Жовтень', 'CZ': 'Říjen', 'RU': 'Октябрь'}
month_11 = {'UA': 'Листопад', 'CZ': 'Listopad', 'RU': 'Ноябрь'}
month_12 = {'UA': 'Грудень', 'CZ': 'Prosinec', 'RU': 'Декабрь'}

base_sale = {'UA': 'Базовий оклад: ',
             'CZ': 'Základní mzda: ',
             'RU': 'Базовый оклад: '}

other_var = {'UA': 'Введіть інше значення',
             'CZ': 'Zadejte jinou hodnotu',
             'RU': 'Ввести другое значение'}

hour_sale = {'UA': 'Напишіть свою погодинну ставку: ',
             'CZ': 'Napište svou hodinovou sazbu: ',
             'RU': 'Напишите Вашу почасовую оплату: '}

public_hol_1 = {'UA': 'Ви працювали у свято?',
                'CZ': 'Pracovali jste na svatek?',
                'RU': 'Вы работали в праздник?'}

public_hol_2 = {'UA': 'Скільки свят ви відпрацювали?',
                'CZ': 'Kolik prázdnin jste pracoval?',
                'RU': 'Сколько праздников вы работали?'}

yes = {'UA': 'Так', 'CZ': 'Ano', 'RU': 'Да'}
no = {'UA': 'Ні', 'CZ': 'Ne', 'RU': 'Нет'}

premium = {'UA': 'Виберіть очікувану премію: ',
           'CZ': 'Zvolte očekávanou prémii: ',
           'RU': 'Выберите ожидаемую премию: '}

holid_hospit_1 = {'UA': 'Ви працювали цілий місяць? ',
                  'CZ': 'Pracovali jsi celý měsíc? ',
                  'RU': 'Вы работали полный месяц? '}

holid_hospit_2 = {'UA': 'Ви були у відпустці чи на лікарняному? ',
                  'CZ': 'Byli jste na dovolené nebo v pracovní neschopnosti? ',
                  'RU': 'Были в отпуске или на больничном? '}

holidays = {'UA': 'Відпустка', 'CZ': 'Mel dovolenou', 'RU': 'Отпуск'}

hospit_1 = {'UA': 'Лікарняний', 'CZ': 'Mel neschopenku', 'RU': 'Больничный'}

len_holid = {'UA': 'Напишіть кількість днів відпустки: ',
             'CZ': 'Napište, kolik dní dovolené jste měli:',
             'RU': 'Напишите количество дней отпуска: '}

hospit_2 = {'UA': 'Я не знаю як розрахувати оплату 😔 лікарняного. \nВиберіть інший варіант.',
            'CZ': 'Omlouváme se. Nevím, jak vypočítat nemocenské 😔. \nVyberte jinou možnost.',
            'RU': 'Я не умею рассчитывать оплату больничного 😔.\nВыберите другой вариант.'}

saturday_1 = {'UA': 'Ви працювали в суботу?',
              'CZ': 'Pracovali jsi v sobotu?',
              'RU': 'Работали в субботу?'}

saturday_2 = {'UA': 'Скільки субот ви працювали?',
              'CZ': 'Kolik sobot jste pracovali?',
              'RU': 'Сколько суббот вы работали?'}

night_1 = {'UA': 'Оберіть свій графік роботи: ',
           'CZ': 'Vyberte si pracovní plán: ',
           'RU': 'Выберите Ваш график работы: '}

night_2 = {'UA': 'Ранні, одполуденні, нічні', 'CZ': 'Ranní, odpolední, noční', 'RU': 'Ранние, одполудние, ночные'}
night_3 = {'UA': 'Ранні, одполуденні', 'CZ': 'Ranní, odpolední', 'RU': 'Ранние, одполудние'}
night_4 = {'UA': 'Ранні', 'CZ': 'Ranní', 'RU': 'Ранние'}

sale_you = {'UA': 'Напишіть свой оклад \n(число більше "0"): ',
            'CZ': 'Napište si základní mzdu \n(číslo větší než "0"): ',
            'RU': 'Напишите Ваш оклад \n(число больше "0"): '}

premium_you = {'UA': 'Напишіть свою премію \n(число більше "0"): ',
               'CZ': 'Zapište očekávané premii \n(číslo větší než "0"): ',
               'RU': 'Напишите Ваш оклад \n(число больше "0"): '}

len_holid_err = {'UA': 'Напишіть кількість днів відпустки \n(число більше "0"): ',
                 'CZ': 'Napište, kolik dní dovolené jste měli \n(číslo větší než "0"): ',
                 'RU': 'Напишите количество дней отпуска \n(число больше "0"): '}

error_value = {'UA': 'Формат неправильний. Повторіть введення \n(число більше за "0"): ',
               'CZ': 'Formát je nesprávný. Napište znovu \n(číslo větší než "0"): ',
               'RU': "Неверный формат. Повторите ввод \n(число больше '0'): "}

error_value_holid = {'UA': "Неправильний формат. Повторіть введення \n(число більше '0', не більше кількості робочих днів місяця): ",
                     'CZ': 'Formát je nesprávný. Napište znovu \n(číslo větší než "0", ne větší než počet pracovních dnů v měsíci): ',
                     'RU': "Неверный формат. Повторите ввод \n(число больше '0', не больше колличества рабочих дней месяца): "}

final_tool_bar = {'UA': 'Виберіть необхідну дію: ',
                  'CZ': 'Vyberte požadovanou akci: ',
                  'RU': 'Выберите необходимое действие: '}

final_tool_bar_btn1 = {'UA': '🔁 Розрахувати знову',
                       'CZ': '🔁 Počítejte znovu',
                       'RU': '🔁 Расчитать снова'}

final_tool_bar_btn2 = {'UA': '📝 Залишити відгук',
                       'CZ': '📝 Zanechte zpětnou vazbu',
                       'RU': '📝 Оставить отзыв'}

cansel = {'UA': '❎ Вийти',
          'CZ': '❎ Dokončit',
          'RU': '❎ Выйти'}

# Финальный список:
hour = {'UA': 'Погодинна ставка: ',
          'CZ': 'Hodinova sazba: ',
          'RU': 'Стоимость часа: '}

fr_sale = {'UA': 'Оклад до сплати: ',
          'CZ': 'Základní mzda: ',
          'RU': 'Оклад к оплате: '}

fr_public_holid_1 = {'UA': 'Доплата за свята: ',
          'CZ': 'Svátek - tarif: ',
          'RU': 'Оплата за праздники: '}

fr_public_holid_2 = {'UA': 'Доплата за святкові: ',
          'CZ': 'Příplatek za svátek: ',
          'RU': 'Доплата за праздники: '}

fr_saturday_1 = {'UA': 'Оплата оклад: ',
          'CZ': 'Základní mzda za přesčas: ',
          'RU': 'Оплата за пресс час: '}

fr_saturday_2 = {'UA': 'Доплата за прес години: ',
          'CZ': 'Příplatek přesčas: ',
          'RU': 'Доплата за пресс час 10%: '}

fr_saturday_3 = {'UA': 'Доплата за суботи: ',
          'CZ': 'Příplatek za Soboty: ',
          'RU': 'Доплата за пресс час 25%: '}

fr_night = {'UA': 'Доплата за нічні: ',
          'CZ': 'Příplatek za noc: ',
          'RU': 'Доплата ночные: '}

fr_holidays = {'UA': 'Відпустка: ',
          'CZ': 'Dovolená: ',
          'RU': 'Отпускные: '}

fr_premium = {'UA': 'Премія: ',
          'CZ': 'Prémie: ',
          'RU': 'Премия: '}

food_stamps = {'UA': 'Стравенки: ',
               'CZ': 'Stravenky: ',
               'RU': 'Стравенки: '}

fr_result = {'UA': 'Груба зп за місяць: ',
          'CZ': 'Hrubá mzda za měsíc: ',
          'RU': 'Грубая зп за месяц: '}

fr_result_1 = {'UA': 'Чиста заробітна плата: ',
               'CZ': 'Čistá mzda na učet: ',
               'RU': 'Чистая зароботная плата: '}

result = {'UA': 'Початкова інформація: ',
          'CZ': 'Základní informace: ',
          'RU': 'Базовая информация: '}

cunt_result = {'UA': 'Розрахункова інформація: ',
          'CZ': 'Vypočítané informace: ',
          'RU': 'Расчётная информация: '}

month = {'UA': 'Місяць: ',
          'CZ': 'Měsíc: ',
          'RU': 'Месяц: '}

feedback_1 = {'UA': 'Напишіть Ваш відгук про додаток: ',
            'CZ': 'Napište svou recenzi na aplikaci: ',
            'RU': 'Напишите Ваш отзыв о приложении: '}

feedback_2 = {'UA': 'Дякую за відгук. Ваша думка дуже важлива для подальшого розвитку програми.',
              'CZ': 'Děkuji za zpětnou vazbu. Váš názor je velmi důležitý pro další vývoj aplikace.',
              'RU': 'Спасибо за отзыв. Ваше мнение очень важно для дальнейшего развития приложения.'}

main_menu = {'UA': '❎ Головне меню',
             'CZ': '❎ Hlavní menu',
             'RU': '❎ Главное меню'}

last_sett = {'UA': 'Останній розрахунок: ',
             'CZ': 'Poslední vypořádání: ',
             'RU': 'Последний расчет: '}

last_calculate = {'UA': 'Декілька останніх розрахунків: ',
                  'CZ': "Pár posledních výpočtů: ",
                  'RU': 'Несколько последних расчетов: '}

select_story = {'UA': 'Виберіть яку історію хочете подивитись: ',
                'CZ': 'Vyberte, který příběh chcete sledovat: ',
                'RU': 'Выберите какую историю хотите посмотреть: '}

date = {'UA': 'Дата: ',
         'CZ': 'Datum: ',
         'RU': 'Дата: '}

calculated = {'UA': 'Очікуйте виконується розрахунок',
              'CZ': 'Počkejte na výpočet',
              'RU': 'Ожидайте выполняется расчет'}

on_error = {'UA': 'Зачекайте, запит обробляється.',
         'CZ': 'Počkejte, žádost se zpracovává.',
         'RU': 'Подождите, запрос обрабатывается.'}